<a href="https://colab.research.google.com/github/MuhammadHamzaAfzal/Python_Class_Work_jz/blob/master/Pandas_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [0]:
df=pd.DataFrame({'Name':['Ali','Ahmed','Rehan','Farhan'],\
                'Marks':[34,45,NA,NA],\
                'Age':np.random.randint(10,20, size=[4])})

In [0]:
df['Marks']=df.Marks.fillna(method='ffill')

In [13]:
df.duplicated(['Marks'])

0    False
1    False
2     True
3     True
dtype: bool

In [14]:
df.drop_duplicates(['Marks'])

    Name  Marks  Age
0    Ali   34.0   11
1  Ahmed   45.0   17

In [0]:
del df["Age"]

In [16]:
df

     Name  Marks
0     Ali   34.0
1   Ahmed   45.0
2   Rehan   45.0
3  Farhan   45.0

In [0]:
name_to_lname = {"Ali":"Raza","Ahmed":"Moiz","Rehan":"Khan","Farhan":"Najeeb"}

In [0]:
df["father_Name"] = df.Name.map(name_to_lname)

In [20]:
df

     Name  Marks father_Name
0     Ali   34.0        Raza
1   Ahmed   45.0        Moiz
2   Rehan   45.0        Khan
3  Farhan   45.0      Najeeb

In [0]:
df = pd.DataFrame({"Name":["Ali","Ahsan","Hamza","Umer","Ali"]
                   , "Marks":(np.random.randint(50,90 , size = [5]))
                   , "Age": (np.random.randint(10,25 , size=[5]))})

np.random.seed(5)

In [22]:
df

    Name  Marks  Age
0    Ali     73   17
1  Ahsan     53   16
2  Hamza     71   24
3   Umer     58   18
4    Ali     59   13

In [30]:
df["Result"] = df["Marks"].apply( lambda x: "Pass" if x>70 else "Fail")
df

    Name  Marks  Age Result
0    Ali     73   17   Pass
1  Ahsan     53   16   Fail
2  Hamza     71   24   Pass
3   Umer     58   18   Fail
4    Ali     59   13   Fail

In [0]:
df.replace({"Ali":"Taha"},inplace = True)

In [32]:
df

    Name  Marks  Age Result
0   Taha     73   17   Pass
1  Ahsan     53   16   Fail
2  Hamza     71   24   Pass
3   Umer     58   18   Fail
4   Taha     59   13   Fail

In [0]:
df.index = df.index.map(lambda i: "Student"+str(i))

In [34]:
df

           Name  Marks  Age Result
Student0   Taha     73   17   Pass
Student1  Ahsan     53   16   Fail
Student2  Hamza     71   24   Pass
Student3   Umer     58   18   Fail
Student4   Taha     59   13   Fail